app/views/articles/_form.html.erb

          <div class="col-sm-offset-2 col-sm-10">
            <%= f.collection_check_boxes :category_ids, Category.all, :id , :name do |cb| %>
---
SELECT "categories".* FROM "categories"