app/views/articles/show.html.erb

            <li class="article-title"><%= link_to @article.user.username, user_path(@article.user) %></li>
            <li><small><%= pluralize(@article.user.articles.count, "article") if @article.user.articles %></small></li>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 1]]

  <%= simple_format(@article.description) %>
  <% if @article.categories.any? %>
---
SELECT "categories".* FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = $1  [["article_id", 980190967]]
SELECT  1 AS one FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = $1 LIMIT $2  [["article_id", 980190967], ["LIMIT", 1]]