app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
SELECT COUNT(*) FROM "articles"
---
  def index
    @articles = Article.paginate(page: params[:page], per_page: 5)

SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Some random title"], ["description", "wew wdwdwew we"], ["created_at", "2019-05-03 13:24:13.435004"], ["updated_at", "2019-05-03 13:24:13.435004"], ["user_id", 1]]
---
  def create
    @article = Article.new(article_params)
    @article.user = User.last
      if @article.save