app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def show
    @user_articles = @user.articles.paginate(page: params[:page], per_page: 2)
---
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 6]]